// Задание 2
// Вы управляете рестораном, в котором работают разные повара, специализирующиеся на определенных блюдах. Клиенты приходят и делают заказы на разные блюда.

// Необходимо создать систему управления этими заказами, которая позволит:
// Отслеживать, какой повар готовит какое блюдо.
// Записывать, какие блюда заказал каждый клиент.

// Используйте коллекции Map для хранения блюд и их поваров, а также для хранения заказов каждого клиента. В качестве ключей для клиентов используйте объекты.

// Повара и их специализации:

// Виктор - специализация: Пицца.
// Ольга - специализация: Суши.
// Дмитрий - специализация: Десерты.

// Блюда и их повара:

// Пицца "Маргарита" - повар: Виктор.
// Пицца "Пепперони" - повар: Виктор.
// Суши "Филадельфия" - повар: Ольга.
// Суши "Калифорния" - повар: Ольга.
// Тирамису - повар: Дмитрий.
// Чизкейк - повар: Дмитрий.

// Заказы:

// Клиент Алексей заказал: Пиццу "Пепперони" и Тирамису.
// Клиент Мария заказала: Суши "Калифорния" и Пиццу "Маргарита".
// Клиент Ирина заказала: Чизкейк.

// Повара и их специализации:
const chefs = new Map();
chefs.set("Виктор", "Пицца");
chefs.set("Ольга", "Суши");
chefs.set("Дмитрий", "Десерты");

// Блюда и их повара:
const dishesAndChefs = new Map();
dishesAndChefs.set("Пицца Маргарита", "Виктор");
dishesAndChefs.set("Пицца Пепперони", "Виктор");
dishesAndChefs.set("Суши Филадельфия", "Ольга");
dishesAndChefs.set("Суши Калифорния", "Ольга");
dishesAndChefs.set("Тирамису", "Дмитрий");
dishesAndChefs.set("Чизкейк", "Дмитрий");

const orders = new Map();

const clientOne = { name: "Алексей" };
const clientOneOrder = new Map();
clientOneOrder.set("Пицца Пепперони", 1);
clientOneOrder.set("Тирамису", 1);

const clientTwo = { name: "Мария" };
const clientTwoOrder = new Map();
clientTwoOrder.set("Суши Калифорния", 1);
clientTwoOrder.set("Пицца Маргарита", 1);

const clientThree = { name: "Ирина" };
const clientThreeOrder = new Map();
clientThreeOrder.set("Чизкейк", 1);

orders.set(clientOne, clientOneOrder);
orders.set(clientTwo, clientTwoOrder);
orders.set(clientThree, clientThreeOrder);

console.log("Повара и их специализации:");
for (let [key, value] of chefs) {
  console.log(`Повар ${key} специализируется на ${value}`);
}

console.log("---------------------------------------------------------");

console.log("Отслеживание заказов:");
for (let [key, value] of orders) {
  console.log(`Клиент ${key.name} заказал: ${new Array(...value).join(" ")}`);
}

console.log("---------------------------------------------------------");

console.log("Отслеживание поваров:");
for (let [key, value] of dishesAndChefs) {
  console.log(`Повар ${value} готовит ${key}`);
}
