// Задание 1
// Представьте, что у вас есть класс для управления библиотекой. В этом классе будет приватное свойство для хранения списка книг, а также методы для добавления книги, удаления книги и получения информации о наличии книги.

// Класс должен содержать приватное свойство #books, которое инициализируется пустым массивом и представляет собой список книг в библиотеке.

// Реализуйте геттер allBooks, который возвращает текущий список книг.

// Реализуйте метод addBook(title), который позволяет добавлять книгу в список. Если книга с таким названием уже существует в списке, выбросьте ошибку с соответствующим сообщением.

// Реализуйте метод removeBook(title), который позволит удалять книгу из списка по названию. Если книги с таким названием нет в списке, выбросьте ошибку с соответствующим сообщением.

// Реализуйте метод hasBook(title), который будет проверять наличие книги в библиотеке и возвращать true или false в зависимости от того, есть ли такая книга в списке или нет.

// Реализуйте конструктор, который принимает начальный список книг (массив) в качестве аргумента. Убедитесь, что предоставленный массив не содержит дубликатов; в противном случае выбрасывайте ошибку.

class Library {
  #books = [];

  get allBooks() {
    return this.#books;
  }

  addBook(title) {
    if (this.#books.includes(title)) {
      throw new Error("Книга уже есть в библиотеке.");
    } else {
      this.#books.push(title);
    }
  }

  removeBook(title) {
    const index = this.#books.indexOf(title);
    if (index === -1) {
      throw new Error("Такой книги нет в библиотеке.");
    }
    this.#books.splice(index, 1);
  }

  hasBook(title) {
    return this.#books.includes(title);
  }

  constructor(initialBooks) {
    this.#books = initialBooks;
  }
}

let book = new Library(["Хроники Сиалы", "Пролетая над гнездом кукушки"]);
console.log(book.allBooks);
book.addBook("Флора и Фауна");
//book.addBook("Флора и Фауна"); //Вывод: Книга уже есть в библиотеке
console.log(book.allBooks); //Вывод: ["Хроники Сиалы", "Пролетая на гнездом кукушки", "Флора и Фауна"]
book.removeBook("Пролетая над гнездом кукушки");
console.log(book.allBooks); //Вывод: ["Хроники Сиалы", "Флора и Фауна"]
console.log(book.hasBook("Пролетая над гнездом кукушки")); //Вывод: false
console.log(book.hasBook("Хроники Сиалы")); //Вывод: true
